[AdventSniperM1 X2CharacterTemplate]
strCharacterName="Advent Sniper"

[AdventSniperM2 X2CharacterTemplate]
strCharacterName="Advanced Sniper"

[AdventSniperM3 X2CharacterTemplate]
strCharacterName="Elite Sniper"

[AdventSniperM1_WPN X2WeaponTemplate]
FriendlyName="ADVENT Mag Sniper Rifle"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is unked."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"

[AdventSniperM2_WPN X2WeaponTemplate]
FriendlyName="ADVENT Mag Sniper Rifle"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is unked."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"

[AdventSniperM3_WPN X2WeaponTemplate]
FriendlyName="ADVENT Mag Sniper Rifle"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is unked."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"


[AdvSniperStandardFire X2AbilityTemplate]
LocFriendlyName="Fire Sniper Rifle"
LocHelpText="Fire your Sniper rifle at a target."
LocLongDescription="<Bullet/> The Sniper rifle is powerful and accurate at long range, but always requires two actions to fire<br><Bullet/>Firing the primary weapon always ends a soldier's turn<br>"

[AdvSniperRifleOverwatch X2AbilityTemplate]
LocFriendlyName="Overwatch"
LocHelpText="Fire on the first enemy that moves within your line of sight, with a penalty to to aim."
LocLongDescriptionWhenConcealed="Fire on the first enemy that moves within your line of sight, but only if revealed."
LocFlyOverText="Overwatch"
LocFriendlyNameWhenConcealed="Overwatch (Concealed)"

[AdvSniperSquadsight X2AbilityTemplate]
LocFriendlyName="Squadsight"
LocLongDescription="The Advent Sniper can target enemies within squadmates' sight, provided there is line of sight to the target."
LocHelpText="The Advent Sniper can target enemies within squadmates' sight, provided there is line of sight to the target."
LocFlyOverText="Squadsight"

[AdvSniperLongWatch X2AbilityTemplate]
LocFriendlyName="Long Watch"
LocLongDescription="Allow Overwatch to trigger with Squadsight."
LocHelpText="Fire on the first enemy that moves within your line of sight (in Squadsight range.)"
LocLongDescriptionWhenConcealed="Fire on the first enemy that moves within your line of sight (in Squadsight range), but only if you are revealed."
LocFlyOverText="Long Watch"

[AdvSniperLongWatchShot X2AbilityTemplate]
LocFriendlyName="Long Watch Shot"

[CorpseAdventSniper X2ItemTemplate]
FriendlyName="ADVENT Sniper Corpse"
FriendlyNamePlural="ADVENT Sniper Corpses"
BriefSummary="While identical as the ADVENT Trooper, the ADVENT Sniper's eyes have been tampered with a unknown susbtance, likely to improve their aiming capabilities." 

[AutopsyAdventSniper X2TechTemplate]
DisplayName="ADVENT Sniper Autopsy"
Summary="ADVENT Snipers are the most recent variance of the ADVENT troops. Improving the alien long range power by giving them a magnetic Sniper rifle capable of shooting from immense distance."
CodeName="Simo"
LongDescription="The ADVENT Sniper is for the most part completely identical to the ADVENT Troopers, however we have discovered a unknown substance inside their eyes. The substance travels from pupil all the way to the optic nerve. We are uncertain of what this particular substance is produced, and we are unable to replicate it. Upon further study, we concluded that the substance helps the user focus, more than their ADVENT allies and most likely their alien overlords. It also improves their eyesight, we believe the ADVENT Sniper are capable of noticing the smallest movement from dozens of kilometers away. These Snipers were the aliens most current deployment, as there were no Snipers sighted during the invasion. Their weapons are similar to the ADVENT Assult Rifle, except there's a vast improvent on the weapon's scope. R. Tygan."
AlertString="ADVENT Sniper"

[AdventSniperM1_XCOM X2WeaponTemplate]
FriendlyName="Harbinger Rifle"
BriefSummary="The sniper rifle the Advent Sniper uses. It has a superb modular structure, enabling our soldiers to equip three upgrades right off the bat. Using the magnetic technology that ADVENT uses, it's a clear upgrade from our conventional rifles."
TacticalText="<Bullet/> The sniper rifle always takes two actions to fire.\n<Bullet/> The sniper rifle suffers a penalty to hit at close range.\n<Bullet/> The sniper rifle uses magnetic projectiles, and can be equiped with three weapon upgrades."

[AdventSniperM2_XCOM X2WeaponTemplate]
FriendlyName="Advanced Harbinger Rifle"
BriefSummary="The sniper rifle the Advent Sniper uses. It has a superb modular structure, enabling our soldiers to equip three upgrades right off the bat. Using the magnetic technology that ADVENT uses, it's a clear upgrade from our conventional rifles."
TacticalText="<Bullet/> The sniper rifle always takes two actions to fire.\n<Bullet/> The sniper rifle suffers a penalty to hit at close range.\n<Bullet/> The sniper rifle uses magnetic projectiles, and can be equiped with three weapon upgrades."

[AdventSniperM3_XCOM X2WeaponTemplate]
FriendlyName="Prime Harbinger Rifle"
BriefSummary="The sniper rifle the Advent Sniper uses. It has a superb modular structure, enabling our soldiers to equip three upgrades right off the bat. Using the magnetic technology that ADVENT uses, it's a clear upgrade from our conventional rifles."
TacticalText="<Bullet/> The sniper rifle always takes two actions to fire.\n<Bullet/> The sniper rifle suffers a penalty to hit at close range.\n<Bullet/> The sniper rifle uses magnetic projectiles, and can be equiped with three weapon upgrades.\n<Bullet/>Pierces one point of armor."